OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdsa_verify.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include <stddef.h>
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_error.h"
#include "app_util.h"
#include "nrf_section.h"
#include "nrf_crypto.h"
#include "common_test.h"

/**@brief ECDSA test vectors can be found on NIST web pages.
 *
 * https://csrc.nist.gov/Projects/Cryptographic-Algorithm-Validation-Program/Component-Testing
 */

#if NRF_CRYPTO_ECC_ENABLED

/*lint -save -e91 */

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R1)
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R1)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R2)
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R2)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP192R1)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA256)
// ECDSA verify - NIST CAVS 11.0 P-192, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha256_1) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp192r1 valid sha256 1",
    .p_input                   = "f1d42d1c663fa4d88325458d31fb08b35e8fac7cebc04b224db57439680c9be4",
    .p_qx                      = "b870597b4b8dc8fc07ed59b6f079e87936d56d0326c17249",
    .p_qy                      = "e54c404920cd530f0680d8aa2a4fb70b5f8605e6ebbf2751",
    .p_r                       = "b53dc1abd4f65d5e0506fa146bee65ecb6cd5353830b67ea",
    .p_s                       = "aa44232f2fa6613f85fda824ded69e4137cdf5688c6b3ba9"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha256_2) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp192r1 valid sha256 2",
    .p_input                   = "cab19f4afca519c6c8a2a09ba7e631ff56cc898694b64123b62e3c94b9fb4696",
    .p_qx                      = "795bbf28b86af380c2b080e622f92f81de6d2af41a39bc39",
    .p_qy                      = "3d3bcfcbe704426e95d0edbf40eae25a259af239b00158c9",
    .p_r                       = "5a3fd911aac408cce41e0eaf42761cce155c5a6efe03df11",
    .p_s                       = "605ffbb146bf787888d9c3e45f79d0bc6959dcfacfaea437"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha256_3) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp192r1 valid sha256 3",
    .p_input                   = "786f3a4c00a899bfcd2a79e59ad387562c49e01370ee2fc9feab605a3552e37d",
    .p_qx                      = "8109731205bd9e363c0521cddf94af58129af3f38d276f2a",
    .p_qy                      = "9fcf7695165bafb39c2d53b61c4ccfed3891abc6db1fc22c",
    .p_r                       = "cac3fe60f567724f7afb825aeda68c3b345b44ef3879dc70",
    .p_s                       = "4544b7d4457b61b66cabfd6174f2c5a594b2c0f300b0e8ea"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha256_inv_r) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp192r1 R changed sha256",
    .p_input                   = "e9097723aedbac5d15745568fdca435aea353bd0c002b12f9253ee4424377c61",
    .p_qx                      = "390ca1526943a85332c96aab75a10ec30fda9fb197ded9aa",
    .p_qy                      = "1260266139849659339e3cbb83a9ee3a63f45ff7b96266bb",
    .p_r                       = "fdbe0c0864213e258abbedc29dd359a4c58e060c351b15fd",
    .p_s                       = "3dc705de56f9c1d6e7774dbb70dd48d34c891bcffbcc30df"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha256_inv_s) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp192r1 S changed sha256",
    .p_input                   = "4e2ddd608a1de8f2f929947c5bb722345724f909e4e18effd571299c480217d1",
    .p_qx                      = "8698b9f47ce024b0a139d1aee610c1d549aa3512a990b211",
    .p_qy                      = "998be4c51c70d4fea9b2b2e274dad47175f9d68c8a1c28a4",
    .p_r                       = "13d7c9f471863cd4ee3ce5458f1fa436f12f50f965ee40bc",
    .p_s                       = "8cce6c1787a66f30679b92de51cd3b04a0c1900bc1008133"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha256_inv_q) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp192r1 Q changed sha256",
    .p_input                   = "f7d05383c1dd96d0db53de2c33c68eae1fa8328639d7dbe73822ff8a4a480a4c",
    .p_qx                      = "001e75261da06eba07f3ee911276b4b6e25ee37abf54fa41",
    .p_qy                      = "5da176ff885ca3345508bc4c917128b2c87f6ab182113505",
    .p_r                       = "e5e6bb6133dc7dc8926d3705cbced15d5820a29e7ac2de8d",
    .p_s                       = "46a6e3818a7286818250cea5a023be5b401b1026ea316843"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha256_inv_hash) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp192r1 hash changed sha256",
    .p_input                   = "66f284b189756241e94f432b945f176b561c837e75c9a71aafedddcfcd0874c6",
    .p_qx                      = "711bdec50f8409b10fd2cfeb30e9e69c9aa27e3a535fb39a",
    .p_qy                      = "3e90f90551e7eb7eda11fb016b0a386ebf48b4b2f3e8f272",
    .p_r                       = "5e61c8445f402c0c16ddfcd050d2a9fbfe495537c3d76ffb",
    .p_s                       = "09d0219f34b46c528d81d3d9c838253f942528e8f53329a2"
};

