OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdsa_verify.c
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA256)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA512)

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha512_1) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp192r1 valid sha512 1",
    .p_input                   = "86df477d86343fa3a5432d45122c6f025e9b35a7b14ff3db6ffdbbcc17b8cb125f59adb506c2861efca72c3dea5d39550b8bb6d65ade45f1c4f963c6ad357099",
    .p_qx                      = "dea419cbbb2c7be3b59d6eb4db9ca48efb4835eccf8d0a48",
    .p_qy                      = "88dde250494bb6b910e979c5fb3a2fc44d41ae3e761fe85d",
    .p_r                       = "302648f3a89aec847742ec72209ac02d6232fe2363f72fac",
    .p_s                       = "a1895dd201f022c17cd69dab9c5438d2b25f9368aa8b9cc3"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha512_2) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp192r1 valid sha512 2",
    .p_input                   = "6e2286e3f4d125a0cc9d101b879c2207db690207eae578cc94bf2e3593a835fb5e07dcce35dc964dbaf641829bead62be303ba11ce819200920bf54c91f57cd7",
    .p_qx                      = "2d3cffc6aac703d224029d243036cae359af89fb24801481",
    .p_qy                      = "00346a43ccc3cdcc37cb9b2757d5f88fede01a5ac160f253",
    .p_r                       = "3a844183d6a2a59255ef9105a6b8dbbd0662c227ee04be0e",
    .p_s                       = "4f322c112b5cbdc7c23138ac51fb975cff8277676105e5f1"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha512_3) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp192r1 valid sha512 3",
    .p_input                   = "2b268f3f54998d777824b9b148d4c0c03bdde23053798adef5378d9c7c0a9e6e23fb0d5bd8848dbd884de44b15b90e035d3e758ca8a87ca6a9722668d2478bb6",
    .p_qx                      = "fce011d181c4d3c75043ab6936e2e9a7d6964ad47851e290",
    .p_qy                      = "71b52d04ca114434be936d9518f05ef9791997e240da0740",
    .p_r                       = "ee9a4782853080a2cb2415914dee9bb4245def81ffa83491",
    .p_s                       = "a701084db2870488d00a5886f872b81c53552ef31f09addc"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha512_inv_r) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp192r1 R changed sha512",
    .p_input                   = "50337a209852b14ae223f311667c2e05f5cc076d7afca97cce03bf799a836b9991956573f435af2d2ff4122d53df2831b48c1d738edf5bb288d7f43a535b7f92",
    .p_qx                      = "8a3939d2b4b4a5b251d383fdb6450d818f6319bd91ee1b70",
    .p_qy                      = "88c934f7625438d118ec95085851d56e4504e553c6701be3",
    .p_r                       = "4677fb00515485c96be8cd8556984868697edcc1170b2605",
    .p_s                       = "7a5c09c4c65085b9a25d4a2578aac167fe31404cf8dc5858"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha512_inv_s) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp192r1 S changed sha512",
    .p_input                   = "d70fae6073e92dc72945ddb8dc45853473dac4855f70516dbb875c970109a454e43bb9b99c2bd27f6bc9560862d70830549b07365f302d5a46ca696352006c9b",
    .p_qx                      = "28f4063b8f808a9642f2b04f794d61739b883897495cf057",
    .p_qy                      = "9be6fde04d687ea2778f845f881b059488f916c3218f42c9",
    .p_r                       = "15f3e034340d6763ecd73515ddf0b92e383b539c97f78b37",
    .p_s                       = "fa77e58f64141876845f438ac6da7bd4bf8dd3097a1f27e8"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha512_inv_q) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp192r1 Q changed sha512",
    .p_input                   = "53156f080461d45f7b6e3babcc2195c2db62b54ff95b0791637f195faaf5dd70d394b6ed0e2a2d9ea728846327d9ca1c49add43857e565344ef132a004c8e57a",
    .p_qx                      = "3e64f302334d85913234703619381bb0ee8d68e40334dd0e",
    .p_qy                      = "38e6ef6fe5c364f17ff3947e294613bd07fd25e46be9ee29",
    .p_r                       = "eea898e0fd6b8dea2a316cdd03a2f1a9adf0dd5beb004372",
    .p_s                       = "0bd969fcc0f08281367b0b94dac13aa4737a0861e046d93f"
};

// ECDSA verify - NIST CAVS 11.0 P-192, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp192r1_sha512_inv_hash) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp192r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp192r1 hash changed sha512",
    .p_input                   = "5fafc1d67fdb7c64373c35befc61bd886a3c433493dfdbe67c0fcf4ef2f76e1c808b11f68621743b4f8c3f71787850fd588c33fdf5bea7b8b9700d957715a8e1",
    .p_qx                      = "d008c455eadcdb98234cb6ad2d9876b82c5b0c8867ba86d9",
    .p_qy                      = "32c009ec81f8eeb99859af65e246d089d3a0c0cdaecef798",
    .p_r                       = "79f619e30cd68028263f107beab00ce2375c570a4be16487",
    .p_s                       = "82257c9eaf1e7ace39e2804e535d7df86158cf1c40425f50"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA512)
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP192R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP224R1)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA256)

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha256_1) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp224r1 valid sha256 1",
    .p_input                   = "831979405db4eb9dadf01249fa15f68d4846e0ece70a320d3022f75f3dc281cc",
    .p_qx                      = "34c5ff3de565b85bfdd9f0a8b3fb0d46f924c57b276bcc830a1ed580",
    .p_qy                      = "609d22200ef38b410da77f7a8ff2f58448188042978fd9ae1b2b4477",
    .p_r                       = "f0138024fe0516738f3bd0e0fec10defaca8c3b89c161a77489cf2b7",
    .p_s                       = "4ae0934266d9e3d64c2a12f546b132ba0f33ef50abc90e7ef5974805"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha256_2) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp224r1 valid sha256 2",
    .p_input                   = "25ef291dd6a2047ea193f8aedd3f4692f2c135cb519922a17cba3e969423b030",
    .p_qx                      = "a580f9a0cd15abff8e1e712f16b0fd4142d0d773af3c657abc06c2a6",
    .p_qy                      = "22c6286340dc072e64274209eda60503047700571caee64b4a2306c2",
    .p_r                       = "c6fae06274dc052e482102520b49d4ccc4cb7eb8a3ea41bd3680ddad",
    .p_s                       = "50d66b75a2bbd0468be1f9e61bfda85b6329505b0134d60846cbe4b7"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha256_3) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp224r1 valid sha256 3",
    .p_input                   = "e8f714f901cd2390c66f9fa9cb81ecc5f17a82bd934cf19c5ce2bcbd3a985de9",
    .p_qx                      = "5d67c1fca848ba7f3d9de5b1894d3993ac4ebe68cdb0b49553b3b0e9",
    .p_qy                      = "07c219a8323273c81f5694306d0dd1d133a49efce5003bc90f05578f",
    .p_r                       = "767cb6b2efa7a40739830659b0cc24fe3de771d00104b3dcc0f640bc",
    .p_s                       = "f2e7268bc011d79d33f3551d2edd3c95f324955479b8e29e8aba629b"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha256_inv_r) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp224r1 R changed sha256",
    .p_input                   = "21a9f65d4cdcc287e0bf330e4f76f1168d16d0cea796dd6c0e13cd2837decaf1",
    .p_qx                      = "13e84ec2eb993818d7d78330855ee2fbe8ddb548a5e4198e2087b3b2",
    .p_qy                      = "c95dff249e10c506fb547a92ade53c61ddbb667c760e4127a1a7f806",
    .p_r                       = "ed26f00ed696e114305c546ed04db5fc35efa43059c0d8bbcd418d0c",
    .p_s                       = "6e16efbe9501e3055d74966a49232cd76b5d1241468788b4cc7378b4"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha256_inv_s) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp224r1 S changed sha256",
    .p_input                   = "489cd3c10d94f7f284bc4ea472634a5d7f0d280d5abbf139c110ef80c8bf463f",
    .p_qx                      = "465afb14f4bf85022ac1f635f46c0b2f6548bace9352d32f74eab012",
    .p_qy                      = "036371a3246dbf1069d2d268ca431553d1f2bf0181225145881b7be0",
    .p_r                       = "9bcd57a2fec2518903e4b13dc0a7b84bafed5c4908546e94ffae87ed",
    .p_s                       = "a337e06582f6b3973df38b93a0fb2a63f7774b62db50dba557e5cfcc"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha256_inv_q) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp224r1 Q changed sha256",
    .p_input                   = "d8454640ad1f4632cc667823418ae56c62028825d727adfc84afdb0842b0c9a4",
    .p_qx                      = "8856fb8b81a4eacd971a954560018f33cbb71cc1fc243d03f63cabcb",
    .p_qy                      = "28afa26baf31b4d89de1dadd2289006f836f23a11383817ec7e4e799",
    .p_r                       = "efccef331805e71bbf876cbbc2342a6bc4508aea7c691029c8396aef",
    .p_s                       = "bed544d09e28dbf01a30b2cfb61b98ad6201a9818f22b4f543f3e7f5"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha256_inv_hash) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp224r1 hash changed sha256",
    .p_input                   = "d62496d0ee0453e7f13f8d9c57adcd33442a5365f626381ed665f95f528aa198",
    .p_qx                      = "16c23c93699cf665a5da8b2d4baa72c36158d3433b1b945e47204b0d",
    .p_qy                      = "12023703e1b59ec9054ff22d15567b9f74058b47cc13f2ca08ab77c1",
    .p_r                       = "ada849b673a1bd2949a8b4d8fdfc239ec53524a356d37da3c9d17ae2",
    .p_s                       = "698de3a3d8697c2e8e5b2c85fceb8796750c5b44154f01ce86d99e24"
};

