OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdsa_verify.c
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA256)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA512)

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha512_1) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp224r1 valid sha512 1",
    .p_input                   = "eaa81b1236121db12f2036611eb6d3e5386f5733125fb26844cb4188109aae402525fc63bcd73494c36c170d1934b108739d79b0c4f184bd85ffce93b1beecde",
    .p_qx                      = "c6a65011926eb64e02bf472d5ba37841d49cfb7f17a20fb9f59355de",
    .p_qy                      = "386ccb33d944fd7be6b8531863d2b6200cd602d300d7e7681537e53f",
    .p_r                       = "9e7c637a699dd52512faea847079f0ad41b20cd7a5461c36d01e857e",
    .p_s                       = "dec6e9ef361de3f6ec7d87de3129eaac5fd0b43b5f7f58ce46c29173"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha512_2) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp224r1 valid sha512 2",
    .p_input                   = "680aaa97b939a5031737a40b9e34e5fb8047b8a6e495c7c90653458072cb423fb098e6ecef15c9d62d4443337f61cde237c66c1683753e65f8bced5298375bf5",
    .p_qx                      = "f10652c3c2c30a765564f5e393c6c202d436c81fc7d71b88857bd458",
    .p_qy                      = "42979ba5e6c8cd044e262c73e6aa918d8c3e0e08e4bf98ec2d5c6f57",
    .p_r                       = "072e0b130267d8e124dda2d0604f4c575ef4007628fa61f66bcd8f07",
    .p_s                       = "6276475fccda3bee2af7816c7b3ec222e408cec36d0409e672af23b5"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha512_3) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp224r1 valid sha512 3",
    .p_input                   = "d4e0bcf58e2083383ef94b28cfb2710a4e898b2c2a0cf30bebb99c3f2dc93403dd165e1a0c3773ed05adedf967fc92f0a158e5086965a29dab3a4aaa5e9f9911",
    .p_qx                      = "dc85f6701bc95a60ea52f1c476dcb211e5e3eeba5b35dc3a3786113f",
    .p_qy                      = "a52b364fb7c4b4c9155e4ee2d8841386b8a96cbeed1e5c9957214a50",
    .p_r                       = "bdc7b4d3266e54a19f030f3055f83460ccf30fe8f5368be013076081",
    .p_s                       = "82a0e3a21a8d5e9cfcc5a673385cc2d4159498b6c1ef5791b2b02f9f"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha512_inv_r) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp224r1 R changed sha512",
    .p_input                   = "f59946dd73887a1fb945ae3e5b44b574512e36dd7d35925b0bdc3a3f69a88e50dc6ebaaac86092679961a99d7ba5724363c5886e7c2cd566433c5a9d59e2515d",
    .p_qx                      = "6c6a7deef8b3dee2eaa98d8ec877dddb460365968e63ffe5c249a421",
    .p_qy                      = "1ad1715797b5e47c4be24d7ecb8141f1772344a2f643cc66fbcf3f9d",
    .p_r                       = "f778faa2dc2cee7de2af0bbc4339239dc240907e59ac034464ce986b",
    .p_s                       = "2ac929588a8dc8785808c9d4366bd7b1a81e0fc5be0c63e62344c251"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha512_inv_s) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp224r1 S changed sha512",
    .p_input                   = "330f78db9f217f95d99cbcb5414a32523025b85c87ed5aaa3a5e6b006c53cecbbd446166bb9b98e944626332c3266e82356e72110bdbf7df2431b8e7faf59e45",
    .p_qx                      = "ea7efb9a7e7bf693dc0249504ead70dd422ec86806cd649ed57a7ffe",
    .p_qy                      = "33dfb17b1cb244279990019286ab477a2aff2b55c08959deed0b1a28",
    .p_r                       = "deab574de1f971419b7ba9e169866c3a6233fc627c13dc6a8cb88bdc",
    .p_s                       = "8d4c542bb0046da1b3912652a2c84542668cd89920808785d04e4352"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha512_inv_q) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp224r1 Q changed sha512",
    .p_input                   = "3cba2980faf5579c7ddbeb31c3318a162a882129a1efe1fc9acc3219a617c460701f22fd7a5c46b017bd9ec9c40587127319ea14b148d2be4df9875d5bef6e4e",
    .p_qx                      = "72013dd6f5b1eb709b3b7da234987f9a36c6f0b095620b8c31f02381",
    .p_qy                      = "319d54c719b59d91900b3c20d963ddf1a10d80d6601ac155094b075a",
    .p_r                       = "eb38db9b757b3cf04020f09188c789bf0258cd0467cf7d67368e8703",
    .p_s                       = "7664e85f01e67881712b24083f89e838c8b818de4d665494e7016833"
};

// ECDSA verify - NIST CAVS 11.0 P-224, SHA-512
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp224r1_sha512_inv_hash) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp224r1 hash changed sha512",
    .p_input                   = "bb7394f9b30617419daa71573f5ed9d72732930b6d24141ea2bfb6bcdd67f4fd7a7e6caed8fcac76f50bad0616c291ff875d866b4085f2a0201289a0895a319a",
    .p_qx                      = "89cef29515f1d30fdd283625eb59e682023bdf2eb0497288ff700b27",
    .p_qy                      = "ca0a3f7ee4853ae8454fff6e926c7a85dc7852fb4d01cc3de861c53d",
    .p_r                       = "0ff5dba589454d0ee5bb391a4dc8446b1ffd1cf8d66c9fc0f05a8a89",
    .p_s                       = "987c32258cd12b6b9cdcc5915eea5eb79a30ead442179a126b97fa9e"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA512)
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP224R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP256R1)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_HASH_SHA256)

