OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdsa_verify.c
// ECDSA verify - NIST CAVS 11.0 P-256, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp256r1_sha256_1) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp256r1 valid sha256 1",
    .p_input                   = "d1b8ef21eb4182ee270638061063a3f3c16c114e33937f69fb232cc833965a94",
    .p_qx                      = "e424dc61d4bb3cb7ef4344a7f8957a0c5134e16f7a67c074f82e6e12f49abf3c",
    .p_qy                      = "970eed7aa2bc48651545949de1dddaf0127e5965ac85d1243d6f60e7dfaee927",
    .p_r                       = "bf96b99aa49c705c910be33142017c642ff540c76349b9dab72f981fd9347f4f",
    .p_s                       = "17c55095819089c2e03b9cd415abdf12444e323075d98f31920b9e0f57ec871c"
};

// ECDSA verify - NIST CAVS 11.0 P-256, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp256r1_sha256_2) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp256r1 valid sha256 2",
    .p_input                   = "b9336a8d1f3e8ede001d19f41320bc7672d772a3d2cb0e435fff3c27d6804a2c",
    .p_qx                      = "e0fc6a6f50e1c57475673ee54e3a57f9a49f3328e743bf52f335e3eeaa3d2864",
    .p_qy                      = "7f59d689c91e463607d9194d99faf316e25432870816dde63f5d4b373f12f22a",
    .p_r                       = "1d75830cd36f4c9aa181b2c4221e87f176b7f05b7c87824e82e396c88315c407",
    .p_s                       = "cb2acb01dac96efc53a32d4a0d85d0c2e48955214783ecf50a4f0414a319c05a"
};

// ECDSA verify - NIST CAVS 11.0 P-256, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp256r1_sha256_3) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code         = NRF_SUCCESS,
    .p_test_vector_name        = "secp256r1 valid sha256 3",
    .p_input                   = "41007876926a20f821d72d9c6f2c9dae6c03954123ea6e6939d7e6e669438891",
    .p_qx                      = "2d98ea01f754d34bbc3003df5050200abf445ec728556d7ed7d5c54c55552b6d",
    .p_qy                      = "9b52672742d637a32add056dfd6d8792f2a33c2e69dafabea09b960bc61e230a",
    .p_r                       = "06108e525f845d0155bf60193222b3219c98e3d49424c2fb2a0987f825c17959",
    .p_s                       = "62b5cdd591e5b507e560167ba8f6f7cda74673eb315680cb89ccbc4eec477dce"
};

// ECDSA verify - NIST CAVS 11.0 P-256, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp256r1_sha256_inv_r) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp256r1 R changed sha256",
    .p_input                   = "5984eab8854d0a9aa5f0c70f96deeb510e5f9ff8c51befcdc3c41bac53577f22",
    .p_qx                      = "5cf02a00d205bdfee2016f7421807fc38ae69e6b7ccd064ee689fc1a94a9f7d2",
    .p_qy                      = "ec530ce3cc5c9d1af463f264d685afe2b4db4b5828d7e61b748930f3ce622a85",
    .p_r                       = "dc23d130c6117fb5751201455e99f36f59aba1a6a21cf2d0e7481a97451d6693",
    .p_s                       = "d6ce7708c18dbf35d4f8aa7240922dc6823f2e7058cbc1484fcad1599db5018c"
};

// ECDSA verify - NIST CAVS 11.0 P-256, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp256r1_sha256_inv_s) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp256r1 S changed sha256",
    .p_input                   = "a82c31412f537135d1c418bd7136fb5fde9426e70c70e7c2fb11f02f30fdeae2",
    .p_qx                      = "87f8f2b218f49845f6f10eec3877136269f5c1a54736dbdf69f89940cad41555",
    .p_qy                      = "e15f369036f49842fac7a86c8a2b0557609776814448b8f5e84aa9f4395205e9",
    .p_r                       = "d19ff48b324915576416097d2544f7cbdf8768b1454ad20e0baac50e211f23b0",
    .p_s                       = "a3e81e59311cdfff2d4784949f7a2cb50ba6c3a91fa54710568e61aca3e847c6"
};

// ECDSA verify - NIST CAVS 11.0 P-256, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp256r1_sha256_inv_q) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp256r1 Q changed sha256",
    .p_input                   = "44b02ad3088076f997220a68ff0b27a58ecfa528b604427097cce5ca956274c5",
    .p_qx                      = "2ddfd145767883ffbb0ac003ab4a44346d08fa2570b3120dcce94562422244cb",
    .p_qy                      = "5f70c7d11ac2b7a435ccfbbae02c3df1ea6b532cc0e9db74f93fffca7c6f9a64",
    .p_r                       = "9913111cff6f20c5bf453a99cd2c2019a4e749a49724a08774d14e4c113edda8",
    .p_s                       = "9467cd4cd21ecb56b0cab0a9a453b43386845459127a952421f5c6382866c5cc"
};

// ECDSA verify - NIST CAVS 11.0 P-256, SHA-256
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_verify_data, test_vector_ecdsa_verify_t test_vector_ecdsa_verify_secp256r1_sha256_inv_hash) =
{
    .p_curve_info              = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_err_code         = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name        = "secp256r1 hash changed sha256",
    .p_input                   = "d80e9933e86769731ec16ff31e6821531bcf07fcbad9e2ac16ec9e6cb343a870",
    .p_qx                      = "69b7667056e1e11d6caf6e45643f8b21e7a4bebda463c7fdbc13bc98efbd0214",
    .p_qy                      = "d3f9b12eb46c7c6fda0da3fc85bc1fd831557f9abc902a3be3cb3e8be7d1aa2f",
    .p_r                       = "288f7a1cd391842cce21f00e6f15471c04dc182fe4b14d92dc18910879799790",
    .p_s                       = "247b3c4e89a3bcadfea73c7bfd361def43715fa382b8c3edf4ae15d6e55e9979"
};

